app/Controllers/Film.php

INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('Khanzab', '1', ' 1 jam 45 menit', '1687319865_26b6c3d9e2918022c668.jpg')
---
            'duration' => $this->request->getPost('duration'),
            'cover' => $imageName,
        ];
        $this->film->save($data);

DELETE FROM `film`
WHERE `id` IN ('11')
---
    public function destroy($id)
    {
        $decryptedId = decryptUrl($id);
        $this->film->delete($decryptedId);