app/Models/FilmModel.php

SELECT *
FROM `film`
---
    public function getAllData(){
        return $this->findAll();

SELECT `film`.*, `genre`.`nama_genre`
FROM `film`
JOIN `genre` ON `genre`.`id` = `film`.`id_genre`
---
    public function getAllDataJoin(){
        $query = $this->db->table("film")
        ->select("film.*, genre.nama_genre")
        ->join("genre", "genre.id = film.id_genre");
        return $query->get()->getResultArray();